
#+BEGIN_SRC emacs-lisp
;; get builtin formats
(setq formats (nth 2 (assoc 'org reftex-cite-format-builtin)))

;; add new format
(setf (nth 2 (assoc 'org reftex-cite-format-builtin)) 
      (append formats '((?W  . "textcite:%l")
			(?z  . "newcite:%l"))))
                         
(assoc 'org reftex-cite-format-builtin)
#+END_SRC

#+RESULTS:
| org | Org-mode citation | ((13 . cite:%l) (100 . ,%l) (97 . autocite:%l) (116 . citet:%l) (84 . citet*:%l) (112 . citep:%l) (80 . citep*:%l) (104 . citeauthor:%l) (72 . citeauthor*:%l) (121 . citeyear:%l) (120 . citetext:%l) (110 . nocite:%l) (87 . textcite:%l) (87 . textcite:%l) (122 . newcite:%l)) |

